---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsType.ConstructionMethod
source: html/8d70d0f6-01f8-cc39-0134-71cf1392d0cd.htm
---
# Autodesk.Revit.DB.Architecture.StairsType.ConstructionMethod Property

The construction method of the stairs.

## Syntax (C#)
```csharp
public StairsConstructionMethod ConstructionMethod { get; }
```